In [1]:
import pandas as pd

### DataFrame from dictionary

In [2]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [24, 30, 22],
        'City': ['New York', 'Los Angeles', 'Chicago']}

In [3]:
df = pd.DataFrame(data)

In [4]:
df.head()

      Name  Age         City
0    Alice   24     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago

### DataFrame from list of list

In [5]:
data = [['Alice', 24, 'New York'], 
        ['Bob', 30, 'Los Angeles'], 
        ['Charlie', 22, 'Chicago']]

In [6]:
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])

In [7]:
df.head()

      Name  Age         City
0    Alice   24     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago

### DataFrame from series

In [8]:
# Creating the Series
s1 = pd.Series(['Mansoor', 'Ali', 'Sara', 'Ahmed', 'Fatima', 'Usman', 'Ayesha', 'Zain', 'Hassan', 'Rabia'])
s2 = pd.Series([22, 25, 30, 28, 27, 24, 26, 29, 23, 31])
s3 = pd.Series(['Peshawar', 'Lahore', 'Peshawar', 'Karachi', 'Quetta', 'Peshawar', 'Rawalpindi', 'Multan', 'Faisalabad', 'Sialkot'])
s4 = pd.Series(['M', "M", 'F', 'M', 'F', 'M', 'F', 'M', 'M', 'F'])

In [9]:
df = pd.DataFrame({"Name":s1, "Age":s2, "City":s3, 'Gender':s4})

In [10]:
df.head()

      Name  Age      City Gender
0  Mansoor   22  Peshawar      M
1      Ali   25    Lahore      M
2     Sara   30  Peshawar      F
3    Ahmed   28   Karachi      M
4   Fatima   27    Quetta      F

# `Display single column`

In [11]:
df['Name'].head()

0    Mansoor
1        Ali
2       Sara
3      Ahmed
4     Fatima
Name: Name, dtype: object

In [12]:
df[['Name', 'Age']].head()

      Name  Age
0  Mansoor   22
1      Ali   25
2     Sara   30
3    Ahmed   28
4   Fatima   27

#### Select row to display

In [13]:
df.loc[3]

Name        Ahmed
Age            28
City      Karachi
Gender          M
Name: 3, dtype: object

In [14]:
df.iloc[3]

Name        Ahmed
Age            28
City      Karachi
Gender          M
Name: 3, dtype: object

### Slicing

In [15]:
df.iloc[1:4]

    Name  Age      City Gender
1    Ali   25    Lahore      M
2   Sara   30  Peshawar      F
3  Ahmed   28   Karachi      M

# `Data Manipulation`

### Add new column

In [16]:
saleries = pd.Series([230, 158, 543, 235, 678, 532, 678, 342, 500, 544])

In [17]:
df.head(1)

      Name  Age      City Gender
0  Mansoor   22  Peshawar      M

In [18]:
df['Saleries'] = saleries

In [19]:
df.head(2)

      Name  Age      City Gender  Saleries
0  Mansoor   22  Peshawar      M       230
1      Ali   25    Lahore      M       158

### Modify a column.
- We suppose that saleries are increased with 100$. So we add 100 in Saleries column

In [20]:
df['Saleries'] = df['Saleries'] + 100

In [21]:
df.head(2)

      Name  Age      City Gender  Saleries
0  Mansoor   22  Peshawar      M       330
1      Ali   25    Lahore      M       258

### Deleting a column

In [22]:
df.drop('Saleries', axis=1, inplace=True)  # Removes the 'Salary' column

In [23]:
df.head(1)

      Name  Age      City Gender
0  Mansoor   22  Peshawar      M

### Filtering Rows

In [24]:
df[df['Age'] > 25]

     Name  Age        City Gender
2    Sara   30    Peshawar      F
3   Ahmed   28     Karachi      M
4  Fatima   27      Quetta      F
6  Ayesha   26  Rawalpindi      F
7    Zain   29      Multan      M
9   Rabia   31     Sialkot      F

# `Sorting Data`

### Sort by column

In [25]:
df.sort_values('Age')  # Sorts DataFrame by 'Age' column in ascending order

      Name  Age        City Gender
0  Mansoor   22    Peshawar      M
8   Hassan   23  Faisalabad      M
5    Usman   24    Peshawar      M
1      Ali   25      Lahore      M
6   Ayesha   26  Rawalpindi      F
4   Fatima   27      Quetta      F
3    Ahmed   28     Karachi      M
7     Zain   29      Multan      M
2     Sara   30    Peshawar      F
9    Rabia   31     Sialkot      F

### Sort by multiple columns

In [26]:
df['Saleries'] = saleries # Add saleries again for comparison

In [27]:
df.sort_values(['Age', 'Saleries'], ascending=[False, False])

      Name  Age        City Gender  Saleries
9    Rabia   31     Sialkot      F       544
2     Sara   30    Peshawar      F       543
7     Zain   29      Multan      M       342
3    Ahmed   28     Karachi      M       235
4   Fatima   27      Quetta      F       678
6   Ayesha   26  Rawalpindi      F       678
1      Ali   25      Lahore      M       158
5    Usman   24    Peshawar      M       532
8   Hassan   23  Faisalabad      M       500
0  Mansoor   22    Peshawar      M       230

In [28]:
df

      Name  Age        City Gender  Saleries
0  Mansoor   22    Peshawar      M       230
1      Ali   25      Lahore      M       158
2     Sara   30    Peshawar      F       543
3    Ahmed   28     Karachi      M       235
4   Fatima   27      Quetta      F       678
5    Usman   24    Peshawar      M       532
6   Ayesha   26  Rawalpindi      F       678
7     Zain   29      Multan      M       342
8   Hassan   23  Faisalabad      M       500
9    Rabia   31     Sialkot      F       544

# `Grouping and Aggregating`
- `Group By:` Grouping allows you to split the data into groups based on some criteria, and then you can apply aggregation or transformation.

In [32]:
df.groupby('City').mean(numeric_only=True)  # Compute mean only for numeric columns

                  Age  Saleries
City
Faisalabad  23.000000     500.0
Karachi     28.000000     235.0
Lahore      25.000000     158.0
Multan      29.000000     342.0
Peshawar    25.333333     435.0
Quetta      27.000000     678.0
Rawalpindi  26.000000     678.0
Sialkot     31.000000     544.0

In [38]:
# Operation you can perorm on string during aggregate
'''
- first
- last
- nunique
- unique
- size
- max
'''
df.groupby('City').agg({
    'Age': 'mean',       # Numeric column, calculate the mean
    'Saleries': 'mean',    # Another numeric column, calculate the mean
    'Name': 'unique'      # Non-numeric column, return the first value (or any other string operation)
})

                  Age  Saleries                    Name
City
Faisalabad  23.000000     500.0                [Hassan]
Karachi     28.000000     235.0                 [Ahmed]
Lahore      25.000000     158.0                   [Ali]
Multan      29.000000     342.0                  [Zain]
Peshawar    25.333333     435.0  [Mansoor, Sara, Usman]
Quetta      27.000000     678.0                [Fatima]
Rawalpindi  26.000000     678.0                [Ayesha]
Sialkot     31.000000     544.0                 [Rabia]

### Aggregation: You can use aggregate functions like sum(), mean(), count(), etc.

In [29]:
df.groupby('City').agg({'Age': 'mean', 'Saleries': 'sum'})

                  Age  Saleries
City
Faisalabad  23.000000       500
Karachi     28.000000       235
Lahore      25.000000       158
Multan      29.000000       342
Peshawar    25.333333      1305
Quetta      27.000000       678
Rawalpindi  26.000000       678
Sialkot     31.000000       544

### Pivot Tables

#### Pandas also supports pivot tables for summarizing data.

In [30]:
df.pivot_table(values='Saleries', index='City', columns='Gender', aggfunc='mean')

Gender          F      M
City
Faisalabad    NaN  500.0
Karachi       NaN  235.0
Lahore        NaN  158.0
Multan        NaN  342.0
Peshawar    543.0  381.0
Quetta      678.0    NaN
Rawalpindi  678.0    NaN
Sialkot     544.0    NaN